"use client";
import UserComment from "@/src/components/user comment/UserComment";
import Image from "next/image";
import Link from "next/link";
import { useState } from "react";

const Society = () => {
  const [like, setLike] = useState<number>(0);
  const [dislike, setDislike] = useState<number>(0);
  return (
    <div className="w-[91.66666666666667%] h-fit mx-auto pt-[21px] ">
      <div className="lg:w-[62.12121212121212%] md:w-[75%] mb-[97px]    h-fit  mx-auto">
        <h2 className="lg:text-[24px] md:text-[19px] max-md:text-[21px] text-[#333333] font-bold mb-[40px]">
          قبل از اینکه بایدن بتواند اوکراین را نجات دهد، باید از نشست ناتو برای
          نجات خود استفاده کند
        </h2>

        <div className="mx-auto flex flex-col w-fit mb-[24px] ">
          <div className="w-full h-fit flex flex-row justify-between items-start">
            <div className="flex flex-col items-start justify-normal text-[10px] max-lg:text-[12px] text-[#500C0B]">
              <span>سیاسی | 2 روز پیش</span>
              <span>گزارشگر: حسینی بای</span>
            </div>
            <div className="flex flex-row justify-between items-center mb-[24px]">
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M20.6196 13.0701C20.2396 13.0701 19.9196 12.7801 19.8696 12.4001C19.6296 10.1401 18.4096 8.0901 16.5296 6.7901C16.1896 6.5501 16.1096 6.0901 16.3396 5.7501C16.5796 5.4101 17.0496 5.3301 17.3796 5.5601C19.6196 7.1101 21.0596 9.5501 21.3496 12.2401C21.3896 12.6501 21.0996 13.0201 20.6796 13.0701C20.6696 13.0701 20.6396 13.0701 20.6196 13.0701Z"
                  fill="#500C0B"
                />
                <path
                  d="M3.48991 13.12C3.45991 13.12 3.43991 13.12 3.40991 13.12C2.99991 13.07 2.69991 12.7 2.73991 12.29C3.00991 9.60001 4.43991 7.17001 6.64991 5.60001C6.98991 5.36001 7.45991 5.44001 7.69991 5.78001C7.93991 6.12001 7.85991 6.59001 7.51991 6.83001C5.65991 8.14001 4.45991 10.19 4.22991 12.45C4.19991 12.83 3.86991 13.12 3.48991 13.12Z"
                  fill="#500C0B"
                />
                <path
                  d="M12.06 22.61C10.58 22.61 9.16997 22.27 7.84997 21.61C7.47997 21.42 7.32997 20.97 7.51997 20.6C7.70997 20.23 8.15997 20.08 8.52997 20.27C10.69 21.36 13.29 21.38 15.47 20.33C15.84 20.15 16.29 20.31 16.47 20.68C16.65 21.05 16.49 21.5 16.12 21.68C14.84 22.3 13.48 22.61 12.06 22.61Z"
                  fill="#500C0B"
                />
                <path
                  d="M12.0603 8.43988C10.1103 8.43988 8.53027 6.85988 8.53027 4.90988C8.53027 2.95988 10.1103 1.37988 12.0603 1.37988C14.0103 1.37988 15.5903 2.95988 15.5903 4.90988C15.5903 6.85988 14.0003 8.43988 12.0603 8.43988ZM12.0603 2.88988C10.9403 2.88988 10.0303 3.79988 10.0303 4.91988C10.0303 6.03988 10.9403 6.94988 12.0603 6.94988C13.1803 6.94988 14.0903 6.03988 14.0903 4.91988C14.0903 3.79988 13.1703 2.88988 12.0603 2.88988Z"
                  fill="#500C0B"
                />
                <path
                  d="M4.8298 20.6701C2.8798 20.6701 1.2998 19.0901 1.2998 17.1401C1.2998 15.2001 2.8798 13.6101 4.8298 13.6101C6.7798 13.6101 8.3598 15.1901 8.3598 17.1401C8.3598 19.0801 6.7798 20.6701 4.8298 20.6701ZM4.8298 15.1101C3.7098 15.1101 2.7998 16.0201 2.7998 17.1401C2.7998 18.2601 3.7098 19.1701 4.8298 19.1701C5.9498 19.1701 6.85981 18.2601 6.85981 17.1401C6.85981 16.0201 5.9498 15.1101 4.8298 15.1101Z"
                  fill="#500C0B"
                />
                <path
                  d="M19.1696 20.6701C17.2196 20.6701 15.6396 19.0901 15.6396 17.1401C15.6396 15.2001 17.2196 13.6101 19.1696 13.6101C21.1196 13.6101 22.6996 15.1901 22.6996 17.1401C22.6896 19.0801 21.1096 20.6701 19.1696 20.6701ZM19.1696 15.1101C18.0496 15.1101 17.1396 16.0201 17.1396 17.1401C17.1396 18.2601 18.0496 19.1701 19.1696 19.1701C20.2896 19.1701 21.1996 18.2601 21.1996 17.1401C21.1896 16.0201 20.2896 15.1101 19.1696 15.1101Z"
                  fill="#500C0B"
                />
              </svg>
              <span className="text-[12px] font-normal text-[#500C0B]">
                اشتراک گذاری
              </span>
            </div>
          </div>
          <Image
            src={"/images/biden.png"}
            width={809}
            height={436}
            alt="post"
            className="mx-auto object-cover"
          />
        </div>
        <p className="md:text-[16px] text-[#333333] font-normal max-md:text-[13px] mb-8  ">
          محمدحسن نجمی - فرشته صائمی: ذات «مناظره» همین است؛ هر کدام معتقد است
          آن دیگری اشتباه می کند و او در طرف حق است؛ بعضا کار به تنش و دعوا هم
          می کشد که شکر خدا در این مناظره چنین نشد؛ هرچند که «موسی غضنفرآبادی»
          نماینده مجلس دوازدهم و «محمود صادقی» نماینده مجلس دهم، که برای مناظره
          به «کافه خبر» خبرگزاری خبرآنلاین آمده بودند، با یکدیگر مجادله های تندی
          داشتند؛ اما قبل و بعد از مناظره اثری از آن نبود. محمود صادقی در این
          مناظره نماینده دیدگاه اصلاح طلبان و به عنوان حامی مسعود پزشکیان بود و
          غضنفرآبادی به عنوان نماینده نگاه اصولگرایی و به عنوان حامی قالیباف.
        </p>
        <Image
          src={"/images/kamellaHaris.png"}
          width={809}
          height={455}
          alt="post"
          className="mb-[24px]"
        />
        <p className="md:text-[16px] text-[#333333] font-normal max-md:text-[13px] mb-[120px]">
          بحث بین این دو، فراز و فرودهایی داشت؛ تا جایی که گاهاً انگشت اتهام‌زنی
          را به سمت یکدیگر می‌بردند و در نهایت می‌گفتند منظور جناح شما است. بحث
          بر روی حجاب و عملکرد دولت‌ها از جمله مباحث مناقشه برانگیز بود. چنانچه
          صادقی قائل به احترام حقوق اقلیت‌ها در بحث حجاب است و می‌گوید برخورد
          پلیسی نباید صورت بگیرد اما غضنفرآبادی می‌گوید حجاب قانون است و اقلیت و
          غیره نمی‌شناسد، ضمناً برخورد پلیس نیست و اقدام است. در ادامه مناظره
          موسی غضنفرآبادی از حامیان قالیباف و محمود صادقی از حامیان پزشکیان در
          کافه خبر خبرگزاری خبرآنلاین را می‌خوانید: **** *ارزیابی شما از
          ردصلاحیت‌ها و ترکیب داوطلبین فعلی انتخابات ریاست جمهوری به چه صورت
          است؟ صادقی: در وضعیت بسیار حساس کنونی (خنده) که واقعاً این بار حساس
          است، به دلیل وضعیت غیرمنتظره و غیرمترقبه سانحه تلخ و ناگوار سقوط
          هلی‌کوپتر رئیس جمهور فقید و همراهانش، بر اساس اصل ۱۳۱ قانون اساسی،
          کشور دارد به سرعت به سمت انتخابات و تعیین دولت جدید می‌رود. البته
          رهبری هم فرمودند که ما می‌توانیم این تهدید را به یک فرصت تبدیل کنیم.
          فکر می‌کنم بزرگ‌ترین فرصت در این زمینه، زمینه‌سازی برای مشارکت هر چه
          بیشتر مردم در انتخابات است، آن هم بعد از سه انتخابات کم فروغ و بخصوص
          انتخابات اخیر که پایین‌ترین میزان مشارکت را داشت. فکر می‌کنم اگر
          بتوانیم با همراهی مجموعه نظام سیاسی، حاکمیت و فعالان سیاسی و احزاب و
          مردم، مجموعاً یک کار ملی در زمینه انتخابات صورت بگیرد، یک انتخاب
          واقعاً ملی انجام شود، می‌شود آن تهدید را تبدیل به فرصت کرد. مخصوصاً با
          وجود تهدیدهای فزاینده خارجی و بین‌المللی و پیش‌بینی‌هایی که در این
          عرصه می‌شود، یکی از مکانیزم‌های تقویت سرمایه اجتماعی نظام برای کاهش
          تهدیدها، تقویت همبستگی ملی و سرمایه اجتماعی و اعتماد به رابطه بین
          حاکمیت و مردم و رسیدن به اهداف، برگزاری یک انتخابات مشارکتی، رقابتی،
          عادلانه، منصفانه و مؤثر است. صادقی: شاهد حضور همه طیف‌های سیاسی در این
          انتخابات نیستیم همانطور که می‌دانید من از منظر اصلاح‌طلبان به این
          موضوع نگاه می‌کنم؛ در انتخابات ۱۴۰۲ از نظر اصلاح‌طلبان، انتخابات واجد
          شرایط سه گانه رقابتی، مشارکتی بودن و تاثیرگذار و معنادار بودن نبود و
          به همین دلیل شاهد کاهش مشارکت بودیم و اصلاح‌طلبان هم نتوانستند در آن
          انتخابات مشارکت فعالی داشته باشند اما در این انتخابات به دلایل مختلفی
          می‌توانیم راهبرد متفاوتی اتخاذ کنیم. نابراین انتخابات از این جهت
          می‌تواند موثر و معنی‌دار باشد. یک فرد انتخاب می‌شود اما یک قوه بیشترین
          تاثیرگذاری را در نظام دستگاه اجرایی کشور دارد. اما در بحث رقابتی شدن،
          انتظار می‌رفت که شورای نگهبان دایره نفرات را گسترده‌تر کند. چراکه هنوز
          شاهد حضور همه طیف‌های سیاسی در این انتخابات نیستیم. بخشی از جریانات یا
          اشخاص و افرادی که پایه سهم اجتماعی بالایی دارند، از این فرآیند حذف
          شدند و یک در مقابل پنج قرار گرفته است. البته برای اینکه بنده خیلی ناقص
          صحبت نکرده باشم و آقای غضنفرآبادی برای آن تقابل به زحمت نیافتد، در عین
          حال زمینه رقابت وجود دارد، هر چند ایده‌آل نیست اما می‌شود امیدوار بود
          که این زمینه رقابتی منجر به افزایش مشارکت در این انتخابات شود.
        </p>
        <div className="flex flex-row justify-between mr-auto w-fit gap-x-[14px] max-sm:mx-auto ">
          <Link
            className="w-[110px] h-[40px] rounded-[5px] leading-[40px] text-center text-[white] bg-[#EB5757] text-[16px] font-normal"
            href={"/"}
          >
            آمریکا
          </Link>
          <Link
            className="w-[110px] h-[40px] rounded-[5px] leading-[40px] text-center text-[white] bg-[#EB5757] text-[16px] font-normal"
            href={"/"}
          >
            سیاست
          </Link>
        </div>
      </div>
      <div className="w-[74.5454545454545%]  mx-auto mb-[64px]">
        <span className="w-[129px] h-[48px] text-center leading-[48px] block bg-[#500C0B] text-white rounded-t-[5px]">
          نظرات کاربران
        </span>
        <hr className="mb-3 bg-[#500C0B] border-none h-[1px] " />
        <div className="w-full  ">
          <h3 className="text-[16px] font-bold text-[#333333] mb-[12px]">
            رضا ناصری
          </h3>
          <p className="text-[16px] font-normal text-[#333333] mb-[12px]">
            با تشکر از سایت خیلی خوبتون
          </p>
          <div className="flex flex-row gap-x-[40px]">
            <button className="flex flex-row items-center justify-center active:scale-95 transition-all ease-linear duration-150  gap-x-2 w-[80px] text-[14px] font-normal  h-[30px] text-[#500C0B] rounded-[5px]  border-solid border-[1px] border-[#500C0B]">
              <svg
                width="22"
                height="22"
                viewBox="0 0 22 22"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M15.4645 17.4717H8.13118C5.22535 17.4717 2.86035 15.1067 2.86035 12.2008C2.86035 9.29499 5.22535 6.92999 8.13118 6.92999H18.2145C18.5904 6.92999 18.902 7.24166 18.902 7.61749C18.902 7.99333 18.5904 8.30499 18.2145 8.30499H8.13118C5.98618 8.30499 4.23535 10.0558 4.23535 12.2008C4.23535 14.3458 5.98618 16.0967 8.13118 16.0967H15.4645C15.8404 16.0967 16.152 16.4083 16.152 16.7842C16.152 17.16 15.8495 17.4717 15.4645 17.4717Z"
                  fill="#500C0B"
                />
                <path
                  d="M16.1061 10.5967C15.9319 10.5967 15.7578 10.5325 15.6203 10.395C15.3544 10.1292 15.3544 9.68917 15.6203 9.42333L17.4811 7.5625L15.6203 5.70167C15.3544 5.43583 15.3544 4.99583 15.6203 4.73C15.8861 4.46417 16.3261 4.46417 16.5919 4.73L18.9386 7.07667C19.2044 7.3425 19.2044 7.7825 18.9386 8.04833L16.5919 10.395C16.4544 10.5325 16.2803 10.5967 16.1061 10.5967Z"
                  fill="#500C0B"
                />
              </svg>
              <span>پاسخ</span>
            </button>
            <div className="flex flex-row justify-start items-center gap-x-[14px] mb-[19px]">
              <div className="flex flex-row items-center">
                <button
                  onClick={() => {
                    setLike(like + 1);
                  }}
                  className=" flex flex-row justify-center items-center h-[24px] w-[33px] gap-x-1 active:scale-95 transition-all ease-linear duration-150 "
                >
                  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M10.7996 22.1C10.5096 22.1 10.2196 22.05 9.94955 21.95C8.69955 21.54 7.89955 20.16 8.17955 18.88L8.66955 15.73C8.67955 15.66 8.67955 15.56 8.60955 15.48C8.55955 15.43 8.48955 15.4 8.40955 15.4H4.40955C3.42955 15.4 2.57955 14.99 2.07955 14.28C1.58955 13.59 1.48955 12.68 1.80955 11.8L4.19955 4.51999C4.56955 3.06999 6.11955 1.89999 7.71955 1.89999H11.5196C12.0796 1.89999 13.2996 2.06999 13.9496 2.71999L16.9796 5.05999L16.0596 6.24999L12.9596 3.84999C12.7096 3.59999 12.0796 3.39999 11.5196 3.39999H7.71955C6.81955 3.39999 5.84955 4.11999 5.64955 4.92999L3.22955 12.28C3.06955 12.72 3.09955 13.12 3.30955 13.41C3.52955 13.72 3.92955 13.9 4.41955 13.9H8.41955C8.93955 13.9 9.41955 14.12 9.74955 14.5C10.0896 14.89 10.2396 15.41 10.1596 15.95L9.65955 19.16C9.53955 19.72 9.91955 20.35 10.4596 20.53C10.9396 20.71 11.5796 20.45 11.7996 20.13L15.8996 14.03L17.1396 14.87L13.0396 20.97C12.5696 21.67 11.6796 22.1 10.7996 22.1Z"
                      fill="#500C0B"
                    />
                    <path
                      d="M19.6201 18.1H18.6201C16.7701 18.1 15.8701 17.23 15.8701 15.45V5.65C15.8701 3.87 16.7701 3 18.6201 3H19.6201C21.4701 3 22.3701 3.87 22.3701 5.65V15.45C22.3701 17.23 21.4701 18.1 19.6201 18.1ZM18.6201 4.5C17.5301 4.5 17.3701 4.76 17.3701 5.65V15.45C17.3701 16.34 17.5301 16.6 18.6201 16.6H19.6201C20.7101 16.6 20.8701 16.34 20.8701 15.45V5.65C20.8701 4.76 20.7101 4.5 19.6201 4.5H18.6201Z"
                      fill="#500C0B"
                    />
                  </svg>
                </button>

                <span className="mt-1">{like}</span>
              </div>
              <div className="flex flex-row items-center">
                <button
                  onClick={() => {
                    setDislike(dislike + 1);
                  }}
                  className=" flex flex-row justify-center items-center h-[24px] w-[33px] gap-x-1 active:scale-95 transition-all ease-linear duration-150 "
                >
                  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M16.2804 22.1H12.4804C11.9204 22.1 10.7004 21.93 10.0504 21.28L7.02035 18.94L7.94035 17.75L11.0404 20.15C11.2904 20.39 11.9204 20.59 12.4804 20.59H16.2804C17.1804 20.59 18.1504 19.87 18.3504 19.06L20.7704 11.71C20.9304 11.27 20.9004 10.87 20.6904 10.58C20.4704 10.27 20.0704 10.09 19.5804 10.09H15.5804C15.0604 10.09 14.5804 9.87001 14.2504 9.49001C13.9104 9.10001 13.7604 8.58001 13.8404 8.04001L14.3404 4.83001C14.4604 4.27001 14.0804 3.64001 13.5404 3.46001C13.0504 3.28001 12.4204 3.54001 12.2004 3.86001L8.10035 9.96001L6.86035 9.13001L10.9604 3.03001C11.5904 2.09001 12.9704 1.64001 14.0504 2.05001C15.3004 2.46001 16.1004 3.84001 15.8204 5.12001L15.3304 8.27001C15.3204 8.34001 15.3204 8.44001 15.3904 8.52001C15.4404 8.57001 15.5104 8.60001 15.5904 8.60001H19.5904C20.5704 8.60001 21.4204 9.01001 21.9204 9.72001C22.4104 10.41 22.5104 11.32 22.1904 12.2L19.8004 19.48C19.4304 20.93 17.8904 22.1 16.2804 22.1Z"
                      fill="#500C0B"
                    />
                    <path
                      d="M5.37988 21H4.37988C2.52988 21 1.62988 20.13 1.62988 18.35V8.54999C1.62988 6.76999 2.52988 5.89999 4.37988 5.89999H5.37988C7.22988 5.89999 8.12988 6.76999 8.12988 8.54999V18.35C8.12988 20.13 7.22988 21 5.37988 21ZM4.37988 7.39999C3.28988 7.39999 3.12988 7.65999 3.12988 8.54999V18.35C3.12988 19.24 3.28988 19.5 4.37988 19.5H5.37988C6.46988 19.5 6.62988 19.24 6.62988 18.35V8.54999C6.62988 7.65999 6.46988 7.39999 5.37988 7.39999H4.37988Z"
                      fill="#500C0B"
                    />
                  </svg>
                </button>

                <span className="mt-1">{dislike}</span>
              </div>
            </div>
          </div>
        </div>

        <hr className="h-[1px] w-full bg-[#E0E0E0] border-none mb-4" />
        <div className="w-full  ">
          <h3 className="text-[16px] font-bold text-[#333333] mb-[12px]">
            محبوبه باقری
          </h3>
          <p className="text-[16px] font-normal text-[#333333] mb-[12px]">
            انتخابات از این جهت می‌تواند موثر و معنی‌دار باشد
          </p>
          <div className="flex flex-row gap-x-[40px]">
            <button className="flex flex-row items-center justify-center active:scale-95 transition-all ease-linear duration-150  gap-x-2 w-[80px] text-[14px] font-normal  h-[30px] text-[#500C0B] rounded-[5px]  border-solid border-[1px] border-[#500C0B]">
              <svg
                width="22"
                height="22"
                viewBox="0 0 22 22"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M15.4645 17.4717H8.13118C5.22535 17.4717 2.86035 15.1067 2.86035 12.2008C2.86035 9.29499 5.22535 6.92999 8.13118 6.92999H18.2145C18.5904 6.92999 18.902 7.24166 18.902 7.61749C18.902 7.99333 18.5904 8.30499 18.2145 8.30499H8.13118C5.98618 8.30499 4.23535 10.0558 4.23535 12.2008C4.23535 14.3458 5.98618 16.0967 8.13118 16.0967H15.4645C15.8404 16.0967 16.152 16.4083 16.152 16.7842C16.152 17.16 15.8495 17.4717 15.4645 17.4717Z"
                  fill="#500C0B"
                />
                <path
                  d="M16.1061 10.5967C15.9319 10.5967 15.7578 10.5325 15.6203 10.395C15.3544 10.1292 15.3544 9.68917 15.6203 9.42333L17.4811 7.5625L15.6203 5.70167C15.3544 5.43583 15.3544 4.99583 15.6203 4.73C15.8861 4.46417 16.3261 4.46417 16.5919 4.73L18.9386 7.07667C19.2044 7.3425 19.2044 7.7825 18.9386 8.04833L16.5919 10.395C16.4544 10.5325 16.2803 10.5967 16.1061 10.5967Z"
                  fill="#500C0B"
                />
              </svg>
              <span>پاسخ</span>
            </button>
            <div className="flex flex-row justify-start items-center gap-x-[14px] mb-[19px]">
              <div className="flex flex-row items-center">
                <button
                  onClick={() => {
                    setLike(like + 1);
                  }}
                  className=" flex flex-row justify-center items-center h-[24px] w-[33px] gap-x-1 active:scale-95 transition-all ease-linear duration-150 "
                >
                  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M10.7996 22.1C10.5096 22.1 10.2196 22.05 9.94955 21.95C8.69955 21.54 7.89955 20.16 8.17955 18.88L8.66955 15.73C8.67955 15.66 8.67955 15.56 8.60955 15.48C8.55955 15.43 8.48955 15.4 8.40955 15.4H4.40955C3.42955 15.4 2.57955 14.99 2.07955 14.28C1.58955 13.59 1.48955 12.68 1.80955 11.8L4.19955 4.51999C4.56955 3.06999 6.11955 1.89999 7.71955 1.89999H11.5196C12.0796 1.89999 13.2996 2.06999 13.9496 2.71999L16.9796 5.05999L16.0596 6.24999L12.9596 3.84999C12.7096 3.59999 12.0796 3.39999 11.5196 3.39999H7.71955C6.81955 3.39999 5.84955 4.11999 5.64955 4.92999L3.22955 12.28C3.06955 12.72 3.09955 13.12 3.30955 13.41C3.52955 13.72 3.92955 13.9 4.41955 13.9H8.41955C8.93955 13.9 9.41955 14.12 9.74955 14.5C10.0896 14.89 10.2396 15.41 10.1596 15.95L9.65955 19.16C9.53955 19.72 9.91955 20.35 10.4596 20.53C10.9396 20.71 11.5796 20.45 11.7996 20.13L15.8996 14.03L17.1396 14.87L13.0396 20.97C12.5696 21.67 11.6796 22.1 10.7996 22.1Z"
                      fill="#500C0B"
                    />
                    <path
                      d="M19.6201 18.1H18.6201C16.7701 18.1 15.8701 17.23 15.8701 15.45V5.65C15.8701 3.87 16.7701 3 18.6201 3H19.6201C21.4701 3 22.3701 3.87 22.3701 5.65V15.45C22.3701 17.23 21.4701 18.1 19.6201 18.1ZM18.6201 4.5C17.5301 4.5 17.3701 4.76 17.3701 5.65V15.45C17.3701 16.34 17.5301 16.6 18.6201 16.6H19.6201C20.7101 16.6 20.8701 16.34 20.8701 15.45V5.65C20.8701 4.76 20.7101 4.5 19.6201 4.5H18.6201Z"
                      fill="#500C0B"
                    />
                  </svg>
                </button>

                <span className="mt-1">{like}</span>
              </div>
              <div className="flex flex-row items-center">
                <button
                  onClick={() => {
                    setDislike(dislike + 1);
                  }}
                  className=" flex flex-row justify-center items-center h-[24px] w-[33px] gap-x-1 active:scale-95 transition-all ease-linear duration-150 "
                >
                  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M16.2804 22.1H12.4804C11.9204 22.1 10.7004 21.93 10.0504 21.28L7.02035 18.94L7.94035 17.75L11.0404 20.15C11.2904 20.39 11.9204 20.59 12.4804 20.59H16.2804C17.1804 20.59 18.1504 19.87 18.3504 19.06L20.7704 11.71C20.9304 11.27 20.9004 10.87 20.6904 10.58C20.4704 10.27 20.0704 10.09 19.5804 10.09H15.5804C15.0604 10.09 14.5804 9.87001 14.2504 9.49001C13.9104 9.10001 13.7604 8.58001 13.8404 8.04001L14.3404 4.83001C14.4604 4.27001 14.0804 3.64001 13.5404 3.46001C13.0504 3.28001 12.4204 3.54001 12.2004 3.86001L8.10035 9.96001L6.86035 9.13001L10.9604 3.03001C11.5904 2.09001 12.9704 1.64001 14.0504 2.05001C15.3004 2.46001 16.1004 3.84001 15.8204 5.12001L15.3304 8.27001C15.3204 8.34001 15.3204 8.44001 15.3904 8.52001C15.4404 8.57001 15.5104 8.60001 15.5904 8.60001H19.5904C20.5704 8.60001 21.4204 9.01001 21.9204 9.72001C22.4104 10.41 22.5104 11.32 22.1904 12.2L19.8004 19.48C19.4304 20.93 17.8904 22.1 16.2804 22.1Z"
                      fill="#500C0B"
                    />
                    <path
                      d="M5.37988 21H4.37988C2.52988 21 1.62988 20.13 1.62988 18.35V8.54999C1.62988 6.76999 2.52988 5.89999 4.37988 5.89999H5.37988C7.22988 5.89999 8.12988 6.76999 8.12988 8.54999V18.35C8.12988 20.13 7.22988 21 5.37988 21ZM4.37988 7.39999C3.28988 7.39999 3.12988 7.65999 3.12988 8.54999V18.35C3.12988 19.24 3.28988 19.5 4.37988 19.5H5.37988C6.46988 19.5 6.62988 19.24 6.62988 18.35V8.54999C6.62988 7.65999 6.46988 7.39999 5.37988 7.39999H4.37988Z"
                      fill="#500C0B"
                    />
                  </svg>
                </button>

                <span className="mt-1">{dislike}</span>
              </div>
            </div>
          </div>
        </div>

        <hr className="h-[1px] w-full bg-[#E0E0E0] border-none mb-4" />
        <div className="w-full  ">
          <h3 className="text-[16px] font-bold text-[#333333] mb-[12px]">
            ریحانه احمد پور
          </h3>
          <p className="text-[16px] font-normal text-[#333333] mb-[23px]">
            شاهد حضور همه طیف‌های سیاسی در این انتخابات نیستیم انتخابات از این
            جهت می‌تواند موثر و معنی‌دار باشد
          </p>
          <div className=" border border-r-[#333333] border-y-transparent border-l-transparent flex flex-row gap-x-5 items-end max-md:flex-col mb-[65px] ">
            <div className="pr-[24px] ">
              <h3 className="text-[16px] font-bold text-[#333333] mb-[12px]">
                ناصر رحمتی
              </h3>
              <p className="text-[16px] font-normal text-[#333333] ">
                بخشی از جریانات یا اشخاص و افرادی که پایه سهم اجتماعی بالایی
                دارند
              </p>
            </div>
            <div className="flex flex-row gap-x-[40px] items-end mt-4 h-fit">
              <button className="flex flex-row items-center justify-center active:scale-95 transition-all ease-linear duration-150  gap-x-2 w-[80px] text-[14px] font-normal  h-[30px] text-[#500C0B] rounded-[5px]  border-solid border-[1px] border-[#500C0B]">
                <svg
                  width="22"
                  height="22"
                  viewBox="0 0 22 22"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M15.4645 17.4717H8.13118C5.22535 17.4717 2.86035 15.1067 2.86035 12.2008C2.86035 9.29499 5.22535 6.92999 8.13118 6.92999H18.2145C18.5904 6.92999 18.902 7.24166 18.902 7.61749C18.902 7.99333 18.5904 8.30499 18.2145 8.30499H8.13118C5.98618 8.30499 4.23535 10.0558 4.23535 12.2008C4.23535 14.3458 5.98618 16.0967 8.13118 16.0967H15.4645C15.8404 16.0967 16.152 16.4083 16.152 16.7842C16.152 17.16 15.8495 17.4717 15.4645 17.4717Z"
                    fill="#500C0B"
                  />
                  <path
                    d="M16.1061 10.5967C15.9319 10.5967 15.7578 10.5325 15.6203 10.395C15.3544 10.1292 15.3544 9.68917 15.6203 9.42333L17.4811 7.5625L15.6203 5.70167C15.3544 5.43583 15.3544 4.99583 15.6203 4.73C15.8861 4.46417 16.3261 4.46417 16.5919 4.73L18.9386 7.07667C19.2044 7.3425 19.2044 7.7825 18.9386 8.04833L16.5919 10.395C16.4544 10.5325 16.2803 10.5967 16.1061 10.5967Z"
                    fill="#500C0B"
                  />
                </svg>
                <span>پاسخ</span>
              </button>
              <div className="flex flex-row justify-start items-end gap-x-[14px] ">
                <div className="flex flex-row items-center">
                  <button
                    onClick={() => {
                      setLike(like + 1);
                    }}
                    className=" flex flex-row justify-center items-center h-[24px] w-[33px] gap-x-1 active:scale-95 transition-all ease-linear duration-150 "
                  >
                    <svg
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        d="M10.7996 22.1C10.5096 22.1 10.2196 22.05 9.94955 21.95C8.69955 21.54 7.89955 20.16 8.17955 18.88L8.66955 15.73C8.67955 15.66 8.67955 15.56 8.60955 15.48C8.55955 15.43 8.48955 15.4 8.40955 15.4H4.40955C3.42955 15.4 2.57955 14.99 2.07955 14.28C1.58955 13.59 1.48955 12.68 1.80955 11.8L4.19955 4.51999C4.56955 3.06999 6.11955 1.89999 7.71955 1.89999H11.5196C12.0796 1.89999 13.2996 2.06999 13.9496 2.71999L16.9796 5.05999L16.0596 6.24999L12.9596 3.84999C12.7096 3.59999 12.0796 3.39999 11.5196 3.39999H7.71955C6.81955 3.39999 5.84955 4.11999 5.64955 4.92999L3.22955 12.28C3.06955 12.72 3.09955 13.12 3.30955 13.41C3.52955 13.72 3.92955 13.9 4.41955 13.9H8.41955C8.93955 13.9 9.41955 14.12 9.74955 14.5C10.0896 14.89 10.2396 15.41 10.1596 15.95L9.65955 19.16C9.53955 19.72 9.91955 20.35 10.4596 20.53C10.9396 20.71 11.5796 20.45 11.7996 20.13L15.8996 14.03L17.1396 14.87L13.0396 20.97C12.5696 21.67 11.6796 22.1 10.7996 22.1Z"
                        fill="#500C0B"
                      />
                      <path
                        d="M19.6201 18.1H18.6201C16.7701 18.1 15.8701 17.23 15.8701 15.45V5.65C15.8701 3.87 16.7701 3 18.6201 3H19.6201C21.4701 3 22.3701 3.87 22.3701 5.65V15.45C22.3701 17.23 21.4701 18.1 19.6201 18.1ZM18.6201 4.5C17.5301 4.5 17.3701 4.76 17.3701 5.65V15.45C17.3701 16.34 17.5301 16.6 18.6201 16.6H19.6201C20.7101 16.6 20.8701 16.34 20.8701 15.45V5.65C20.8701 4.76 20.7101 4.5 19.6201 4.5H18.6201Z"
                        fill="#500C0B"
                      />
                    </svg>
                  </button>

                  <span className="mt-1">{like}</span>
                </div>
                <div className="flex flex-row items-center">
                  <button
                    onClick={() => {
                      setDislike(dislike + 1);
                    }}
                    className=" flex flex-row justify-center items-center h-[24px] w-[33px] gap-x-1 active:scale-95 transition-all ease-linear duration-150 "
                  >
                    <svg
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        d="M16.2804 22.1H12.4804C11.9204 22.1 10.7004 21.93 10.0504 21.28L7.02035 18.94L7.94035 17.75L11.0404 20.15C11.2904 20.39 11.9204 20.59 12.4804 20.59H16.2804C17.1804 20.59 18.1504 19.87 18.3504 19.06L20.7704 11.71C20.9304 11.27 20.9004 10.87 20.6904 10.58C20.4704 10.27 20.0704 10.09 19.5804 10.09H15.5804C15.0604 10.09 14.5804 9.87001 14.2504 9.49001C13.9104 9.10001 13.7604 8.58001 13.8404 8.04001L14.3404 4.83001C14.4604 4.27001 14.0804 3.64001 13.5404 3.46001C13.0504 3.28001 12.4204 3.54001 12.2004 3.86001L8.10035 9.96001L6.86035 9.13001L10.9604 3.03001C11.5904 2.09001 12.9704 1.64001 14.0504 2.05001C15.3004 2.46001 16.1004 3.84001 15.8204 5.12001L15.3304 8.27001C15.3204 8.34001 15.3204 8.44001 15.3904 8.52001C15.4404 8.57001 15.5104 8.60001 15.5904 8.60001H19.5904C20.5704 8.60001 21.4204 9.01001 21.9204 9.72001C22.4104 10.41 22.5104 11.32 22.1904 12.2L19.8004 19.48C19.4304 20.93 17.8904 22.1 16.2804 22.1Z"
                        fill="#500C0B"
                      />
                      <path
                        d="M5.37988 21H4.37988C2.52988 21 1.62988 20.13 1.62988 18.35V8.54999C1.62988 6.76999 2.52988 5.89999 4.37988 5.89999H5.37988C7.22988 5.89999 8.12988 6.76999 8.12988 8.54999V18.35C8.12988 20.13 7.22988 21 5.37988 21ZM4.37988 7.39999C3.28988 7.39999 3.12988 7.65999 3.12988 8.54999V18.35C3.12988 19.24 3.28988 19.5 4.37988 19.5H5.37988C6.46988 19.5 6.62988 19.24 6.62988 18.35V8.54999C6.62988 7.65999 6.46988 7.39999 5.37988 7.39999H4.37988Z"
                        fill="#500C0B"
                      />
                    </svg>
                  </button>

                  <span className="mt-1">{dislike}</span>
                </div>
              </div>
            </div>
          </div>
          <div className="flex flex-row gap-x-[40px] mt-4">
            <button className="flex flex-row items-center justify-center active:scale-95 transition-all ease-linear duration-150  gap-x-2 w-[80px] text-[14px] font-normal  h-[30px] text-[#500C0B] rounded-[5px]  border-solid border-[1px] border-[#500C0B]">
              <svg
                width="22"
                height="22"
                viewBox="0 0 22 22"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M15.4645 17.4717H8.13118C5.22535 17.4717 2.86035 15.1067 2.86035 12.2008C2.86035 9.29499 5.22535 6.92999 8.13118 6.92999H18.2145C18.5904 6.92999 18.902 7.24166 18.902 7.61749C18.902 7.99333 18.5904 8.30499 18.2145 8.30499H8.13118C5.98618 8.30499 4.23535 10.0558 4.23535 12.2008C4.23535 14.3458 5.98618 16.0967 8.13118 16.0967H15.4645C15.8404 16.0967 16.152 16.4083 16.152 16.7842C16.152 17.16 15.8495 17.4717 15.4645 17.4717Z"
                  fill="#500C0B"
                />
                <path
                  d="M16.1061 10.5967C15.9319 10.5967 15.7578 10.5325 15.6203 10.395C15.3544 10.1292 15.3544 9.68917 15.6203 9.42333L17.4811 7.5625L15.6203 5.70167C15.3544 5.43583 15.3544 4.99583 15.6203 4.73C15.8861 4.46417 16.3261 4.46417 16.5919 4.73L18.9386 7.07667C19.2044 7.3425 19.2044 7.7825 18.9386 8.04833L16.5919 10.395C16.4544 10.5325 16.2803 10.5967 16.1061 10.5967Z"
                  fill="#500C0B"
                />
              </svg>
              <span>پاسخ</span>
            </button>
            <div className="flex flex-row justify-start items-center gap-x-[14px] mb-[19px]">
              <div className="flex flex-row items-center">
                <button
                  onClick={() => {
                    setLike(like + 1);
                  }}
                  className=" flex flex-row justify-center items-center h-[24px] w-[33px] gap-x-1 active:scale-95 transition-all ease-linear duration-150 "
                >
                  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M10.7996 22.1C10.5096 22.1 10.2196 22.05 9.94955 21.95C8.69955 21.54 7.89955 20.16 8.17955 18.88L8.66955 15.73C8.67955 15.66 8.67955 15.56 8.60955 15.48C8.55955 15.43 8.48955 15.4 8.40955 15.4H4.40955C3.42955 15.4 2.57955 14.99 2.07955 14.28C1.58955 13.59 1.48955 12.68 1.80955 11.8L4.19955 4.51999C4.56955 3.06999 6.11955 1.89999 7.71955 1.89999H11.5196C12.0796 1.89999 13.2996 2.06999 13.9496 2.71999L16.9796 5.05999L16.0596 6.24999L12.9596 3.84999C12.7096 3.59999 12.0796 3.39999 11.5196 3.39999H7.71955C6.81955 3.39999 5.84955 4.11999 5.64955 4.92999L3.22955 12.28C3.06955 12.72 3.09955 13.12 3.30955 13.41C3.52955 13.72 3.92955 13.9 4.41955 13.9H8.41955C8.93955 13.9 9.41955 14.12 9.74955 14.5C10.0896 14.89 10.2396 15.41 10.1596 15.95L9.65955 19.16C9.53955 19.72 9.91955 20.35 10.4596 20.53C10.9396 20.71 11.5796 20.45 11.7996 20.13L15.8996 14.03L17.1396 14.87L13.0396 20.97C12.5696 21.67 11.6796 22.1 10.7996 22.1Z"
                      fill="#500C0B"
                    />
                    <path
                      d="M19.6201 18.1H18.6201C16.7701 18.1 15.8701 17.23 15.8701 15.45V5.65C15.8701 3.87 16.7701 3 18.6201 3H19.6201C21.4701 3 22.3701 3.87 22.3701 5.65V15.45C22.3701 17.23 21.4701 18.1 19.6201 18.1ZM18.6201 4.5C17.5301 4.5 17.3701 4.76 17.3701 5.65V15.45C17.3701 16.34 17.5301 16.6 18.6201 16.6H19.6201C20.7101 16.6 20.8701 16.34 20.8701 15.45V5.65C20.8701 4.76 20.7101 4.5 19.6201 4.5H18.6201Z"
                      fill="#500C0B"
                    />
                  </svg>
                </button>

                <span className="mt-1">{like}</span>
              </div>
              <div className="flex flex-row items-center">
                <button
                  onClick={() => {
                    setDislike(dislike + 1);
                  }}
                  className=" flex flex-row justify-center items-center h-[24px] w-[33px] gap-x-1 active:scale-95 transition-all ease-linear duration-150 "
                >
                  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M16.2804 22.1H12.4804C11.9204 22.1 10.7004 21.93 10.0504 21.28L7.02035 18.94L7.94035 17.75L11.0404 20.15C11.2904 20.39 11.9204 20.59 12.4804 20.59H16.2804C17.1804 20.59 18.1504 19.87 18.3504 19.06L20.7704 11.71C20.9304 11.27 20.9004 10.87 20.6904 10.58C20.4704 10.27 20.0704 10.09 19.5804 10.09H15.5804C15.0604 10.09 14.5804 9.87001 14.2504 9.49001C13.9104 9.10001 13.7604 8.58001 13.8404 8.04001L14.3404 4.83001C14.4604 4.27001 14.0804 3.64001 13.5404 3.46001C13.0504 3.28001 12.4204 3.54001 12.2004 3.86001L8.10035 9.96001L6.86035 9.13001L10.9604 3.03001C11.5904 2.09001 12.9704 1.64001 14.0504 2.05001C15.3004 2.46001 16.1004 3.84001 15.8204 5.12001L15.3304 8.27001C15.3204 8.34001 15.3204 8.44001 15.3904 8.52001C15.4404 8.57001 15.5104 8.60001 15.5904 8.60001H19.5904C20.5704 8.60001 21.4204 9.01001 21.9204 9.72001C22.4104 10.41 22.5104 11.32 22.1904 12.2L19.8004 19.48C19.4304 20.93 17.8904 22.1 16.2804 22.1Z"
                      fill="#500C0B"
                    />
                    <path
                      d="M5.37988 21H4.37988C2.52988 21 1.62988 20.13 1.62988 18.35V8.54999C1.62988 6.76999 2.52988 5.89999 4.37988 5.89999H5.37988C7.22988 5.89999 8.12988 6.76999 8.12988 8.54999V18.35C8.12988 20.13 7.22988 21 5.37988 21ZM4.37988 7.39999C3.28988 7.39999 3.12988 7.65999 3.12988 8.54999V18.35C3.12988 19.24 3.28988 19.5 4.37988 19.5H5.37988C6.46988 19.5 6.62988 19.24 6.62988 18.35V8.54999C6.62988 7.65999 6.46988 7.39999 5.37988 7.39999H4.37988Z"
                      fill="#500C0B"
                    />
                  </svg>
                </button>

                <span className="mt-1">{dislike}</span>
              </div>
            </div>
          </div>
        </div>

        <hr className="h-[1px] w-full bg-[#E0E0E0] border-none mb-4" />
      </div>
      <UserComment />
      <div className="w-[74.5454545454545%] mx-auto">
        <span className="w-[129px] h-[48px] text-center leading-[48px] block bg-[#500C0B] text-white rounded-t-[5px]">
          اخبار مرتبط{" "}
        </span>
        <hr className="mb-[52px] bg-[#500C0B] border-none h-[1px]  " />
        <div className="w-[87.09349593495935%] h-fit max-lg:w-full mb-[112px]    mx-auto">
          <div className="w-full  h-fit flex flex-row gap-x-[53px]  overflow-auto max-sm:w-[95%] max-[476px]:w-full max-sm:mx-auto  scrollbar-thin scrollbar-thumb-[#AC2043]  scrollbar-track-white ">
            <div className="w-fit h-fit rel lg:min-w-[173px]">
              <Image
                src={"/images/military.png"}
                width={173}
                height={34}
                alt="image"
                className="max-lg:min-w-[173px] mb-1"
              />
              <span className="text-[14px] text-[#333333] block mb-[24px]">
                چگونه کودتا در بولیوی شکست خورد؟
              </span>
              <p className="text-[12px] text-[#3F3F3F] ">
                بولیوی با پشت سرگذاشتن یک روز نفس گیر توانست کودتای نظامیان این
                کشور علیه رئیس جمهور را خنثی کند.
              </p>
              <span className=" block text-left text-[10px] text-[#828282] mb-[14px]">
                جهان 2‌ روز پیش
              </span>
              <hr className="text-[#9F9F9F]" />
            </div>
            <div className="w-fit h-fit rel lg:min-w-[173px]">
              <Image
                src={"/images/money.png"}
                width={173}
                height={34}
                alt="image"
                className="max-lg:min-w-[173px] mb-1"
              />
              <span className="text-[14px] text-[#333333] block xl:leading-[14px] mb-[24px]">
                پیامدهای عدم تصویب اف ای تی اف/ موافقین و مخالفین چه می‌گویند؟
              </span>
              <p className="text-[12px] text-[#3F3F3F] ">
                یکی از مهمترین محورهای منازعه نامزدهای انتخابات ریاست جمهوری
              </p>
              <span className=" block text-left text-[10px] text-[#828282] mb-[14px]">
                جهان 2‌ روز پیش
              </span>
              <hr className="text-[#9F9F9F]" />
            </div>
            <div className="w-fit h-fit rel lg:min-w-[173px]">
              <Image
                src={"/images/woman.png"}
                width={173}
                height={34}
                alt="image"
                className="max-lg:min-w-[173px] mb-1"
              />
              <span className="text-[14px] text-[#333333] block mb-[24px]">
                آلمان از جمهوری اسلامی ایران کمک خواست
              </span>
              <p className="text-[12px] text-[#3F3F3F] ">
                وزیر خارجه آلمان با سرپرست وزارت خارجه ایران، خواستار کمک تهران
                برای جلوگیری از تشدید تنش در منطقه شد.
              </p>
              <span className=" block text-left text-[10px] text-[#828282] mb-[14px]">
                جهان 2‌ روز پیش
              </span>
              <hr className="text-[#9F9F9F]" />
            </div>
            <div className="w-fit h-fit rel lg:min-w-[173px]">
              <Image
                src={"/images/alief.png"}
                width={173}
                height={34}
                alt="image"
                className="max-lg:min-w-[173px] mb-1"
              />
              <span className="text-[14px] text-[#333333] block mb-[24px]">
                الهام علی‌اف پارلمان جمهوری آذربایجان را منحل کرد
              </span>
              <p className="text-[12px] text-[#3F3F3F] ">
                «الهام علی‌اف»، رئیس‌جمهور جمهوری آذربایجان، پارلمان این کشور را
                منحل کرد.
              </p>
              <span className=" block text-left text-[10px] text-[#828282] mb-[14px]">
                جهان 2‌ روز پیش
              </span>
              <hr className="text-[#9F9F9F]" />
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};
export default Society;
